constant/cladding/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/cladding/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4
(
extremos
{
    type            fixedValue;
    physicalType    patch;
    nFaces          70;
    startFace       143;
    value           uniform 0;
}

parede
{
    type            fixedValue;
    physicalType    patch;
    nFaces          8;
    startFace       213;
    value           uniform 0;
}

cladding_to_coolant
{
    type            mappedWall;
    inGroups        1 ( wall );
    nFaces          28;
    startFace       221;
    sampleMode      nearestPatchFace;
    sampleRegion    coolant;
    samplePatch     coolant_to_cladding;
}

cladding_to_fuel
{
    type            mappedWall;
    inGroups        1 ( wall );
    nFaces          28;
    startFace       249;
    sampleMode      nearestPatchFace;
    sampleRegion    fuel;
    samplePatch     fuel_to_cladding;
}

)


// ************************************************************************* //
