0/fuel/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuel";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 900;

boundaryField
{
    extremos
    {
        type            zeroGradient;
        value           uniform 0;
    }
    parede
    {
        type            zeroGradient;
        value           uniform 0;
    }
    fuel_to_cladding
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 900;
        Tnbr            T;
        kappa           solidThermo;
        kappaName       none;
        thicknessLayers ( 0.1 );
        kappaLayers     ( 10 );
    }
}


// ************************************************************************* //
