system/coolant/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;

        smoother         GaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    "(U|h|k|epsilon)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.1;
    }
}

SIMPLE
{
    momentumPredictor on;
    nNonOrthogonalCorrectors 0; 
    pRefCell        0;
    pRefValue       1750000;
    rhoMin          rhoMin [1 -3 0 0 0] 900; //300; 
    rhoMax          rhoMax [1 -3 0 0 0] 1100; ////1e9; //1200; 
}

relaxationFactors
{
    fields
    {
        rho             1;
        p_rgh           0.7; //0.8;
    }
    equations
    {
        U               0.3;
        h               0.8;
        nuTilda         0.8;
        k               0.8;
        epsilon         0.8;
        omega           0.8;
        "ILambda.*"     0.8;
    }
}

// ************************************************************************* //
